[
  {
    "title": "102 Dalmatians",
    "year": 2000,
    "cast": [
      "Glenn Close",
      "Gérard Depardieu",
      "Alice Evans"
    ],
    "genres": [
      "Comedy",
      "Family",
      "Crime"
    ],
    "href": "102_Dalmatians",
    "extract": "102 Dalmatians is a 2000 American crime comedy film directed by Kevin Lima and produced by Edward S. Feldman and Walt Disney Pictures. The sequel to the 1996 film 101 Dalmatians, a live-action remake of the 1961 Disney animated film of the same name, it stars Glenn Close reprising her role as Cruella de Vil as she attempts to steal puppies for her \"grandest\" fur coat yet. Glenn Close and Tim McInnerny were the only two actors from the 1996 film to return for the sequel. The film received generally negative reviews from critics and was unable to achieve the box office success of its predecessor, although the film was nominated for the Academy Award for Best Costume Design.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fe/102_dalmatians_poster.jpg",
    "thumbnail_width": 220,
    "thumbnail_height": 327
  },
  {
    "title": "28 Days",
    "year": 2000,
    "cast": [
      "Sandra Bullock",
      "Viggo Mortensen"
    ],
    "genres": [
      "Drama",
      "Comedy"
    ],
    "href": "28_Days_(film)",
    "extract": "28 Days is a 2000 American comedy-drama film directed by Betty Thomas and written by Susannah Grant. Sandra Bullock stars as Gwen Cummings, a newspaper columnist obliged to enter rehabilitation for alcoholism. The film costars Viggo Mortensen, Dominic West, Elizabeth Perkins, Azura Skye, Steve Buscemi, and Diane Ladd.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/28_Days_Poster.jpg",
    "thumbnail_width": 238,
    "thumbnail_height": 360
  },
  {
    "title": "3 Strikes",
    "year": 2000,
    "cast": [
      "Brian Hooks",
      "N'Bushe Wright"
    ],
    "genres": [
      "Comedy"
    ],
    "href": "3_Strikes_(film)",
    "extract": "3 Strikes is a 2000 American comedy film written and directed by DJ Pooh, and starring Brian Hooks, N'Bushe Wright, Faizon Love and David Alan Grier. Despite some commercial success, it was negatively received by critics. The title refers to California's habitual offender law, whereby three convictions confer an automatic life sentence.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/db/3_Strikes_Poster.jpg",
    "thumbnail_width": 225,
    "thumbnail_height": 333
  },
  {
    "title": "The 6th Day",
    "year": 2000,
    "cast": [
      "Arnold Schwarzenegger",
      "Robert Duvall",
      "Michael Rooker",
      "Tony Goldwyn",
      "Michael Rapaport",
      "Sarah Wynter",
      "Rodney Rowland",
      "Wendy Crewson",
      "Terry Crews"
    ],
    "genres": [
      "Science Fiction",
      "Action"
    ],
    "href": "The_6th_Day",
    "extract": "The 6th Day is a 2000 American science fiction action film directed by Roger Spottiswoode and starring Arnold Schwarzenegger, Tony Goldwyn, Michael Rapaport, and Robert Duvall. In the film, a family man of the future is illegally cloned by accident as part of a vast conspiracy involving a shady billionaire businessman, and is thrust into a struggle to clear his name and protect his family from the conspirators who seek to keep the cloning a secret. The title refers to the Judeo-Christian Genesis creation narrative, where God created mankind on the sixth day. The film was Terry Crews' acting debut.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a0/The_6th_Day_%282000_film%29.jpg",
    "thumbnail_width": 257,
    "thumbnail_height": 387
  },
  {
    "title": "Across the Line",
    "year": 2000,
    "cast": [
      "Brad Johnson",
      "Adrienne Barbeau",
      "Brian Bloom"
    ],
    "genres": [
      "Thriller",
      "Western"
    ],
    "href": "Across_the_Line_(2000_film)",
    "extract": "Across the Line is a 2000 American Neo-Western film directed by Martin Spottl and starring Brad Johnson and Sigal Erez. Johnson plays a small-town Texas sheriff who falls for an illegal immigrant (Erez) who witnessed a murder on the Mexican border. While not an overtly political film, Across the Line portrays illegal immigrants in a generally positive light and dramatizes their motivations and problems from a sympathetic point of view. In La Opinion Jean Rodriguez Flores wrote, \"The film Across the Line isn't just about the difficulties of crossing illegally into the United States, but it also reflects the tragedy of hundreds of people who are forced to leave their families for the \"promised land.\" Some critics praised the film for its emotional intensity, authenticity, and integrity, but others questioned it for turning the plight of illegal immigrants into mainstream entertainment. Independently financed and produced, Across the Line was distributed by Lionsgate Entertainment.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/49/Across_the_Line.jpg",
    "thumbnail_width": 246,
    "thumbnail_height": 345
  },
  {
    "title": "Adventures in Wild California",
    "year": 2000,
    "cast": [
      "Jimmy Smits",
      "(Narrator)"
    ],
    "genres": [
      "Documentary"
    ],
    "href": "Adventures_in_Wild_California",
    "extract": "Adventures in Wild California is a documentary film showcasing the scenery and extreme sports found in California. It is narrated by Jimmy Smits and was released to IMAX theaters in 2000. The film is directed by Greg MacGillivray and features songs by musician Lindsey Buckingham.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e9/Adventuresinwildcalifornia.jpg",
    "thumbnail_width": 234,
    "thumbnail_height": 425
  },
  {
    "title": "The Adventures of Rocky and Bullwinkle",
    "year": 2000,
    "cast": [
      "Rene Russo",
      "Jason Alexander",
      "Robert De Niro",
      "Piper Perabo",
      "June Foray",
      "Keith Scott"
    ],
    "genres": [
      "Comedy",
      "Live Action",
      "Adventure",
      "Animated"
    ],
    "href": "The_Adventures_of_Rocky_and_Bullwinkle_(film)",
    "extract": "The Adventures of Rocky and Bullwinkle is a 2000 American live-action/animated adventure slapstick comedy film directed by Des McAnuff and produced by Universal Pictures, based on the television cartoon of the same name by Jay Ward. Animated characters Rocky and Bullwinkle share the screen with live actors portraying Fearless Leader, Boris Badenov and Natasha Fatale along with Randy Quaid, Piper Perabo, Kenan Thompson and Kel Mitchell. June Foray reprised her role as Rocky, while Keith Scott voiced Bullwinkle and the film's narrator. It also features cameo appearances by performers including James Rebhorn, Paget Brewster, Janeane Garofalo, John Goodman, David Alan Grier, Don Novello, Jon Polito, Carl Reiner, Whoopi Goldberg, Max Grodenchik, Norman Lloyd, Jonathan Winters and Billy Crystal. The film follows a young rookie FBI agent named Karen Sympathy enlisting the help of Rocky and Bullwinkle to stop Boris, Natasha, and Fearless Leader from taking over the United States.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/78/Adventuresofrockyandbullwinklemovieposter.jpg",
    "thumbnail_width": 269,
    "thumbnail_height": 370
  },
  {
    "title": "All the Pretty Horses",
    "year": 2000,
    "cast": [
      "Matt Damon",
      "Penélope Cruz",
      "Henry Thomas",
      "Lucas Black",
      "Rubén Blades",
      "Míriam Colón",
      "Bruce Dern"
    ],
    "genres": [
      "Western"
    ],
    "href": "All_the_Pretty_Horses_(film)",
    "extract": "All the Pretty Horses is a 2000 American Western film produced and directed by Billy Bob Thornton, based on Cormac McCarthy's novel of the same name, and starring Matt Damon and Penélope Cruz. It premiered on December 25, 2000 to mostly negative reviews. It grossed $18 million worldwide on a $57 million budget.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b0/All_the_Pretty_Horses_Poster.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 385
  },
  {
    "title": "Almost Famous",
    "year": 2000,
    "cast": [
      "Billy Crudup",
      "Frances McDormand",
      "Kate Hudson",
      "Jason Lee",
      "Patrick Fugit",
      "Anna Paquin",
      "Fairuza Balk"
    ],
    "genres": [
      "Comedy",
      "Drama"
    ],
    "href": "Almost_Famous",
    "extract": "Almost Famous is a 2000 American comedy-drama film written and directed by Cameron Crowe, and starring Billy Crudup, Frances McDormand, Kate Hudson, and Patrick Fugit. It tells the story of a teenage journalist, played by Fugit, writing for Rolling Stone magazine in the early 1970s, touring with the fictitious rock band Stillwater, and writing his first cover story on the band. The film is semi-autobiographical, as Crowe himself was a teenage writer for Rolling Stone.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/dd/Almost_famous_poster1.jpg",
    "thumbnail_width": 259,
    "thumbnail_height": 384
  },
  {
    "title": "American Psycho",
    "year": 2000,
    "cast": [
      "Christian Bale",
      "Chloë Sevigny",
      "Willem Dafoe"
    ],
    "genres": [
      "Horror"
    ],
    "href": "American_Psycho_(film)",
    "extract": "American Psycho is a 2000 satirical horror film directed by Mary Harron, who co-wrote the screenplay with Guinevere Turner. Based on the 1991 novel by Bret Easton Ellis, it stars Christian Bale as Patrick Bateman, a New York City investment banker who leads a double life as a serial killer. Willem Dafoe, Jared Leto, Josh Lucas, Chloë Sevigny, Samantha Mathis, Cara Seymour, Justin Theroux, and Reese Witherspoon appear in supporting roles. The film blends horror and black comedy to satirize 1980s yuppie culture and consumerism, exemplified by Bateman and supporting cast.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0c/American_Psycho.png",
    "thumbnail_width": 258,
    "thumbnail_height": 382
  },
  {
    "title": "Animal Factory",
    "year": 2000,
    "cast": [
      "Willem Dafoe",
      "Edward Furlong",
      "Mickey Rourke"
    ],
    "genres": [
      "Noir"
    ],
    "href": "Animal_Factory",
    "extract": "Animal Factory is a 2000 neo-noir film directed by Steve Buscemi and starring Willem Dafoe, Edward Furlong, Danny Trejo, John Heard, Mickey Rourke, Tom Arnold, Seymour Cassel, Shell Galloway and Mark Boone, Jr. Set in San Quentin, the film is about life in prison. It is based on the novel of the same name by Eddie Bunker who plays the part of Buzzard in the film.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/88/AnimalFactory.jpg",
    "thumbnail_width": 258,
    "thumbnail_height": 385
  },
  {
    "title": "The Art of War",
    "year": 2000,
    "cast": [
      "Wesley Snipes",
      "Donald Sutherland"
    ],
    "genres": [
      "Action",
      "Spy"
    ],
    "href": "The_Art_of_War_(film)",
    "extract": "The Art of War is a 2000 action spy film directed by Christian Duguay and starring Wesley Snipes, Michael Biehn, Anne Archer and Donald Sutherland. It is the first installment in The Art of War film series. The film's title refers to the ancient Chinese text of the same name by war strategist Sun Tzu. The film was followed by two direct-to-video sequels, The Art of War II: Betrayal and The Art of War III: Retribution. The latter did not feature Snipes.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a6/Art_of_war_poster.jpg",
    "thumbnail_width": 236,
    "thumbnail_height": 350
  },
  {
    "title": "Autumn in New York",
    "year": 2000,
    "cast": [
      "Richard Gere",
      "Winona Ryder"
    ],
    "genres": [
      "Romance",
      "Drama"
    ],
    "href": "Autumn_in_New_York_(film)",
    "extract": "Autumn in New York is a 2000 American romantic drama film directed by Joan Chen and starring Richard Gere, Winona Ryder, and Anthony LaPaglia. Written by Allison Burnett, the film follows a successful middle-aged restaurateur and womanizer who falls in love with a sweet young woman who is terminally ill. United States distributor MGM took over the film from Chen and significantly re-edited the film, which also involved deleting a Winona Ryder nude scene. The film received generally negative reviews, but was a moderate commercial success, grossing $100 million on a $65 million budget.",
    "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/43/Autumnmovieposter.jpg",
    "thumbnail_width": 267,
    "thumbnail_height": 373
  }
]